# EDA

In [8]:
import pandas as pd


df_supahcoolsoft = pd.read_csv('supahcoolsoft.csv')


df_supahcoolsoft.head()

,EmployeeID,FirstName,LastName,Age,Department,Position,Salary_SEK,Email,PhoneNumber
0,E001,Ann,Larsson,41,Product Management,AI Specialist,60777.0,ann.larsson@supacoolsoft.se,+46 (0)25 37 22 30
1,E002,Emma,Kim,52,Engineering,Database Administrator,46020.0,emma.kim@supacoolsoft.se,+46 (0)855 449 66
2,E003,Barbro,Andersson,59,DevOps,Data Scientist,48503.0,barbro.andersson@supacoolsoft.se,+46 (0)47 61 73 44
3,E004,Magnus,Söderström,52,Product Management,Junior Data Scientist,47296.0,magnus.söderström@supacoolsoft.se,+46 (0)258 579 26
4,E005,Therese,Ljungberg,46,Product Management,Junior Data Scientist,42435.0,therese.ljungberg@supacoolsoft.se,+46 (0)575 495 24

# Shape of the data

In [3]:
df_supahcoolsoft.shape
# shows 100 rows and 9 columns

(100, 9)

In [6]:
df_supahcoolsoft.info()
# shows the data types from each column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   100 non-null    object
 1   FirstName    100 non-null    object
 2   LastName     100 non-null    object
 3   Age          100 non-null    int64
 4   Department   98 non-null     object
 5   Position     99 non-null     object
 6   Salary_SEK   99 non-null     float64
 7   Email        100 non-null    object
 8   PhoneNumber  100 non-null    object
dtypes: float64(1), int64(1), object(7)
memory usage: 7.2+ KB

In [7]:
df_supahcoolsoft.describe()

              Age    Salary_SEK
count  100.000000     99.000000
mean    43.430000  52049.181818
std     10.032528  10993.553359
min     25.000000  30452.000000
25%     35.000000  43179.000000
50%     42.500000  52919.000000
75%     52.000000  60942.000000
max     60.000000  69742.000000

EmployeeID     100
FirstName      100
LastName       100
Age            100
Department     100
Position       100
Salary_SEK     100
Email          100
PhoneNumber    100
dtype: int64